Can't use this type in this host.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId HostMismatch { get; }
  Visual Basic
Public Shared ReadOnly Property HostMismatch As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ HostMismatch {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures HostObjFailures Class
  Autodesk.Revit.DB Namespace